rails/5-auth/auth/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "teste"], ["content", "teste"], ["created_at", "2024-04-25 22:28:55.824841"], ["updated_at", "2024-04-25 22:28:55.824841"], ["user_id", 1]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "content" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["content", "Testando esse artigo"], ["updated_at", "2024-04-25 19:29:51.478557"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 1]]
---
  def destroy
    @article.destroy!