rails/1-fundamentos/blog/app/controllers/comments_controller.rb

    def create
        @comment = @post.comments.create(comment_params)
        @comment.user = current_user

        if @comment.save
---
INSERT INTO "comments" ("post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 1], ["user_id", 1], ["created_at", "2024-04-26 19:12:33.778391"], ["updated_at", "2024-04-26 19:12:33.778391"]]
UPDATE "comments" SET "updated_at" = $1 WHERE "comments"."id" = $2  [["updated_at", "2024-04-26 19:12:33.980385"], ["id", 1]]

    def update
        @comment = @post.comments.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 1], ["id", 1], ["LIMIT", 1]]

    def destroy
        @comment = @post.comments.find(params[:id])
        @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]