rails/1-fundamentos/blog/app/controllers/posts_controller.rb

  def show
    @post.update(views: @post.views + 1)
    @comments = @post.comments.order(:created_at)
---
UPDATE "posts" SET "updated_at" = $1, "views" = $2 WHERE "posts"."id" = $3  [["updated_at", "2024-04-26 14:12:10.752170"], ["views", 1], ["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" ASC  [["post_id", 1]]

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "views", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "teste"], ["body", "ty"], ["created_at", "2024-04-26 14:12:10.711128"], ["updated_at", "2024-04-26 14:12:10.711128"], ["views", 0], ["user_id", 1]]