rails/8-api/storebook/app/controllers/api/v1/authors_controller.rb

    def set_author
      @author = Author.find_by(id: params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]