rails/8-api/storebook/app/controllers/api/v1/authors_controller.rb

  def create
    @author = Author.new(author_params)

    if @author.save
---
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Manoel Carlos"], ["created_at", "2024-04-28 19:40:33.322688"], ["updated_at", "2024-04-28 19:40:33.322688"]]

  def update
    if @author.update(author_params)
---
UPDATE "authors" SET "name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["name", "João Emanuel Cordeiro Jr"], ["updated_at", "2024-04-28 19:41:21.249509"], ["id", 2]]

    def authenticate_request
      token = request.headers['Authorization']
      if token.present?
        begin
          decoded_token = JsonWebTokenService.decode(token.split(' ').last)
          user_id = decoded_token['user_id']
          @current_user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_author
      @author = Author.find_by(id: params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]