rails/8-api/storebook/app/controllers/api/v1/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "RSpec com Rails"], ["body", "Contruindo uma api usando RSpec para Testar"], ["created_at", "2024-04-28 19:42:26.293266"], ["updated_at", "2024-04-28 19:42:26.293266"], ["author_id", 1]]
---
  def create
    @book = Book.new(book_params)
    @book.author_id = params[:author_id]

    if @book.save

UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "RSpec e Rails"], ["updated_at", "2024-04-28 16:29:31.335753"], ["id", 5]]
---
  def update
    if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
    @book.destroy!

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_book
      @book = Book.find_by(id: params[:id])